In [23]:
import pandas as pd
import matplotlib.pyplot as plt

## Data cleaning & preprocessing

In [38]:
df = pd.read_csv("data/terrorism.csv", index_col=0)
#interpolate the views linearly
#df.views = df.views.interpolate(limit_direction = "both")

In [41]:
df

         article     date     views
id
0     abu_sayyaf  2008-01       NaN
1     abu_sayyaf  2008-02    9533.0
2     abu_sayyaf  2008-03   11594.0
3     abu_sayyaf  2008-04   10507.0
4     abu_sayyaf  2008-05   10789.0
...          ...      ...       ...
6331       yemen  2018-08   65799.0
6332       yemen  2018-09   56223.0
6333       yemen  2018-10   77599.0
6334       yemen  2018-11  111798.0
6335       yemen  2018-12   66790.0

[6336 rows x 3 columns]